#include <cstdio>

int Judge(int A)
{
    int cost = 0;
    if(A <= 1500){
        // A中不超过1500元的部分 税率3%
        cost += A*0.03;
    }else if(A <= 4500){
        // A中超过1500元未超过4500元的部分 税率10%
        cost += 1500*0.03;
        cost += (A-1500)*0.10;
    }else if(A <= 9000){
        // A中超过4500元未超过9000元的部分 税率20%
        cost += 1500*0.03;
        cost += (4500-1500)*0.10;
        cost += (A-4500)*0.20;
    }else if(A <= 35000){
        // A中超过9000元未超过35000元的部分 税率25%
        cost += 1500*0.03;
        cost += (4500-1500)*0.10;
        cost += (9000-4500)*0.20;
        cost += (A-9000)*0.25;
    }else if(A <= 55000){
        // A中超过35000元未超过55000元的部分 税率30%
        cost += 1500*0.03;
        cost += (4500-1500)*0.10;
        cost += (9000-4500)*0.20;
        cost += (35000-9000)*0.25;
        cost += (A-35000)*0.30;
    }else if(A <= 80000){
        // A中超过55000元未超过80000元的部分 税率35%
        cost += 1500*0.03;
        cost += (4500-1500)*0.10;
        cost += (9000-4500)*0.20;
        cost += (35000-9000)*0.25;
        cost += (55000-35000)*0.30;
        cost += (A-55000)*0.35;
    }else{
        // A中超过80000元的部分 税率45%
        cost += 1500*0.03;
        cost += (4500-1500)*0.10;
        cost += (9000-4500)*0.20;
        cost += (35000-9000)*0.25;
        cost += (55000-35000)*0.30;
        cost += (80000-55000)*0.35;
        cost += (A-80000)*0.45;
    }
    return cost;
}

int main()
{
    int S, T, A, cost;
    scanf("%d", &T);
    if(T <= 3500) S = T;
    else{
        for(S = T/100*100; ;S += 100){
            A = S - 3500;
            cost = Judge(A);
            if(T == S - cost) break;
        }
    }
    printf("%d\n", S);
    return 0;
}
